### 4)TOP 3 STATES and WORST 3 STATES FOR -- 3-to-2 LANGUAGE RATIO  and 2-to-1 LANGUAGE RATIO

In [1]:
import numpy as np
import pandas as pd
import datetime as dt
import warnings
warnings.filterwarnings('ignore')

In [2]:
pd.set_option('display.max_columns',30)
pd.set_option('display.max_rows',10000)
pd.set_option('display.width',400)

In [3]:
#ASSIGNING COL NAMES
column_names = ['State', 'District', 'Name', 'TRU','Age-group','Persons.2','Males.2','Females.2','Persons.3','Males.3','Females.3']
#READING DATA
df = pd.read_excel('DDW-C18-0000.xlsx',names=column_names,skiprows=5)

In [4]:
#TAKING ONLY REQUIRED COLUMNS "TWO or MORE LANGUAGES" and "THREE OR MORE LANGUAGES"
df = df[['State','Name','TRU','Age-group','Persons.2','Persons.3']]

# REMOVING URBAN AND RURAL ROWS AND AGE-GROUP CATEGORIES OTHER THAN TOTAL
idx = df.loc[(df['TRU']!='Total') | (df['Age-group'] !='Total')].index
df = df.drop(idx)

In [5]:
df.reset_index(inplace=True,drop=True)

In [6]:
df.head()

   State              Name    TRU Age-group  Persons.2  Persons.3
0      0             INDIA  Total     Total  314988770   86009580
1      1   JAMMU & KASHMIR  Total     Total    6183190    2096220
2      2  HIMACHAL PRADESH  Total     Total    1242705     347286
3      3            PUNJAB  Total     Total   13035224    7829913
4      4        CHANDIGARH  Total     Total     579920     321979

In [7]:
# CALCULATING EXACTLY TWO-LANG
df['only2lang'] = df['Persons.2'] - df['Persons.3']

In [8]:
#CALCULATING RATIO 3 to 2 lang
df['r3to2'] = df['Persons.3'] / df['only2lang']

In [9]:
#THIS df is used for  2to1lang ratio CALCULATION AFTERWARDS so creating a COPY
org_df = df.copy()

In [10]:
df = df.sort_values(['r3to2'])   #SORTING DATAFRAME IN ASCENDING ORDER OF RATIOS

In [11]:
df.head()

    State           Name    TRU Age-group  Persons.2  Persons.3  only2lang     r3to2
10     10          BIHAR  Total     Total   16761785    1682572   15079213  0.111582
5       5    UTTARAKHAND  Total     Total    1757756     187822    1569934  0.119637
9       9  UTTAR PRADESH  Total     Total   22873609    2585664   20287945  0.127448
33     33     TAMIL NADU  Total     Total   20416270    2447163   17969107  0.136187
22     22   CHHATTISGARH  Total     Total    3384223     422569    2961654  0.142680

In [12]:
#AN EMPTY DATAFRAME
newdf = pd.DataFrame()

In [13]:
high = df.iloc[[-1,-2,-3],[0,-1]]            # SELECTING TOP 3 RATIOS as data is sorted and selecting columns statecode and ratio
low = df.iloc[[0,1,2],[0,-1]]                # SELECTING LEAST 3 RATIOS and selecting columns statecode and ratio

In [14]:
#high
#low

In [15]:
#APPENDING INTO A SINGLE DATAFRAME
newdf = newdf.append([high,low])

In [16]:
newdf.reset_index(inplace=True,drop=True)

In [17]:
newdf.columns

Index(['State', 'r3to2'], dtype='object')

In [18]:
newdf

   State     r3to2
0     30  1.925807
1      3  1.504216
2      4  1.248266
3     10  0.111582
4      5  0.119637
5      9  0.127448

In [19]:
#RATIO 3-to-2 is completed

PREPROCESSING CENSUSDATA

In [20]:
censuscols = ['State','Level','Name','TRU','TOT_P']
census_data = pd.read_excel(r'DDW_PCA0000_2011_Indiastatedist.xlsx',usecols=censuscols)

In [21]:
#dropping rows OF TRU =(rural,urban) as not needed
a = census_data.loc[(census_data['TRU']=='Rural') | (census_data['TRU']=='Urban') | (census_data['Level'] == 'DISTRICT')].index
census_data = census_data.drop(a)

In [22]:
census_data.reset_index(inplace=True,drop=True)

### RATIO OF 1LANG TO 2lang

In [23]:
#CALCULATING ONLY ONE LANG SPEAKERS  and we use the saved dataframe above
org_df['only1lang'] = census_data['TOT_P'] - org_df['Persons.2']

In [24]:
org_df.head()

   State              Name    TRU Age-group  Persons.2  Persons.3  only2lang     r3to2  only1lang
0      0             INDIA  Total     Total  314988770   86009580  228979190  0.375622  895866207
1      1   JAMMU & KASHMIR  Total     Total    6183190    2096220    4086970  0.512903    6358112
2      2  HIMACHAL PRADESH  Total     Total    1242705     347286     895419  0.387847    5621897
3      3            PUNJAB  Total     Total   13035224    7829913    5205311  1.504216   14708114
4      4        CHANDIGARH  Total     Total     579920     321979     257941  1.248266     475530

In [25]:
#CALCULATING RATIOS
org_df['r2to1'] = org_df['only2lang'] / org_df['only1lang']

#SORTING DATAFRAME
org_df = org_df.sort_values(['r2to1'])

In [26]:
#AN EMPTY DATAFRAME
newdf2 = pd.DataFrame()

In [27]:
high2 = org_df.iloc[[-1,-2,-3],[0,-1]]                 # SELECTING TOP 3 RATIOS as data is sorted
low2 = org_df.iloc[[0,1,2],[0,-1]]                     # SELECTING LEAST 3 RATIOS

In [28]:
#high2
#low2

In [29]:
#APPENDING INTO A SINGLE DATAFRAME
newdf2 = newdf2.append([high2,low2])

In [30]:
newdf2.reset_index(inplace=True,drop=True)

In [31]:
newdf2

   State     r2to1
0     35  1.499862
1     30  1.157976
2     12  0.938953
3      8  0.105877
4      9  0.114661
5     22  0.133643

In [32]:
#WRITING TO CSV
newdf.to_csv('3-to-2-ratio.csv',index = False)
newdf2.to_csv('2-to-1-ratio.csv',index = False)